# IdeaStatiCa.ConnectionApi.Model.ConAnchorGridOperation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ConnectedItems** | **List&lt;ConConnectedItem&gt;** |  | [optional]
**AnchorType** | **ConAnchorType** |  | [optional]
**AnchorAssemblyId** | **int?** |  | [optional]
**EmbedmentDepth** | **double** |  | [optional]
**HookLength** | **double** |  | [optional]
**AnchorDiameter** | **double** |  | [optional]
**HeadDiameter** | **double** |  | [optional]
**HeadedStudMaterialId** | **int?** |  | [optional]
**WasherPlateShape** | **ConWasherPlateShape** |  | [optional]
**WasherPlateSize** | **double** |  | [optional]
**ReinforcementMaterialId** | **int?** |  | [optional]
**ReinforcementShape** | **ConReinforcementAnchorShape** |  | [optional]
**MandrelDiameter** | **double** |  | [optional]
**HookRotations** | **List&lt;double&gt;** |  | [optional]
**IsExploded** | **bool** |  | [optional]
**Geometry** | **ConGridGeometry** |  | [optional]
**DefinedBy** | **ConDefinedBy** |  | [optional]
**CoordinateSystem** | **ConLocalCoordinateSystem** |  | [optional]
**SlottedHoles** | **List&lt;ConSlottedHole&gt;** |  | [optional]
**FoundationBlock** | **ConFoundationBlockDto** |  | [optional]
**PlateSide** | **ConPlateSide** |  | [optional]
**IsImported** | **bool** |  | [optional]
**OperationType** | **string** |  | [optional]
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Active** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)